Documents/Решение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Решение</Name>
			<BasedOn>
				<xr:Item>Document.ЛичноеДело</xr:Item>
				<xr:Item>Document.Талоны</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Решение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявленияДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРешения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РешенияОтказыПоЛичнымДелам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормативноПравовыеАкты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативноПравовыеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотеряАктуальности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Решение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Решение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Решение/Ext/ManagerModule.bsl
#Область ПрограмныйИтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();	
	КомандаПечати.МенеджерПечати = "Документ.Решение";
	КомандаПечати.Идентификатор = "Решение";
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Представление = НСтр("ru = 'Печать решение старое'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати2 = КомандыПечати.Добавить();	
	КомандаПечати2.МенеджерПечати = "Документ.Решение";
	КомандаПечати2.Идентификатор = "РешениеЛьготы";
	КомандаПечати2.МестоРазмещения = "ПодменюПечать";
	КомандаПечати2.Представление = НСтр("ru = 'Печать решение новое'");
	КомандаПечати2.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати3 = КомандыПечати.Добавить();	
	КомандаПечати3.МенеджерПечати = "Документ.Решение";
	КомандаПечати3.Идентификатор = "Уведомление";
	КомандаПечати3.МестоРазмещения = "ПодменюПечать";
	КомандаПечати3.Представление = НСтр("ru = 'Печать уведомление'");
	КомандаПечати3.ПроверкаПроведенияПередПечатью = Ложь;


КонецПроцедуры

Процедура Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"Решение");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРешения(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Печать решение ТБТ старое'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.Решение.ПФ_MXL_МакетРешениеТБТ";
	КонецЕсли;	
	ПечатнаяФорма2 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"РешениеЛьготы");
	Если ПечатнаяФорма2 <> Неопределено Тогда
		ПечатнаяФорма2.ТабличныйДокумент = ПечатьРешенияЛьгота(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма2.СинонимМакета = НСтр("ru = 'Печать решение новое'");
        ПечатнаяФорма2.ПолныйПутьКМакету = "Документ.Решение.ПФ_MXL_МакетРешение";
	КонецЕсли;
	
	ПечатнаяФорма3 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"Уведомление");
	Если ПечатнаяФорма3 <> Неопределено Тогда
		ПечатнаяФорма3.ТабличныйДокумент = ПечатьУведомление(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма3.СинонимМакета = НСтр("ru = 'Печать уведомление'");
        ПечатнаяФорма3.ПолныйПутьКМакету = "Документ.Решение.ПФ_MXL_Уведомление";
	КонецЕсли;

	
КонецПроцедуры
#КонецОбласти

Функция ПечатьРешения(МассивОбъектов,ОбъектыПечати) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Решение";
	Если МассивОбъектов[0].Решение = Перечисления.Решение.Отказ Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Решение.ПФ_MXL_МакетОтказТБТ");
	Иначе 	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Решение.ПФ_MXL_МакетРешениеТБТ");
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Решение КАК ТаблицаДокумента
	               |ГДЕ
	               |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы+1;
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Заявитель = Выборка.Ссылка.Заявитель;
		Шапка.Параметры.НомерЗаявленияДата  = Выборка.Ссылка.НомерЗаявленияДата;
		Шапка.Параметры.Адрес = Выборка.Ссылка.Заявитель.АдресФактическогоПроживания;
		Шапка.Параметры.ЛьготнаяКатегория =  Выборка.Ссылка.ЛьготнаяКатегория;
		Шапка.Параметры.ОписаниеРешения = Выборка.Ссылка.ОписаниеРешения;
		ТабличныйДокумент.Вывести(Шапка);
		Для Каждого СтрокаК Из  Выборка.Ссылка.Комиссия  Цикл
			Область = Макет.ПолучитьОбласть("Должности");
			Область.Параметры.Должность = СтрокаК.Должность;             
			Область.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаК.Сотрудник);
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
		
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,НомерСтрокиНачало,
													   ОбъектыПечати,Выборка.Ссылка);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьРешенияЛьгота(МассивОбъектов,ОбъектыПечати) Экспорт
	Перем НормативОснование;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Решение_Льгота";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Решение.ПФ_MXL_МакетРешение");
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Решение КАК ТаблицаДокумента
	               |ГДЕ
	               |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ПервыйДокумент = Истина;
	Индекс = 0; 	
	Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы+1;
		Если Выборка.Ссылка.Решение = Перечисления.Решение.Утвердить Тогда
			Шапка1 = Макет.ПолучитьОбласть("Шапка1");
			Шапка1.Параметры.ДатаРешение = Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
			Если ЗначениеЗаполнено(Выборка.Ссылка.ВидЛьготы.ТекстДляШапкиРешенияУтвердить) Тогда 
				Шапка1.Параметры.ШапкаРешениеЛьготаУтвердить = Выборка.Ссылка.ВидЛьготы.ТекстДляШапкиРешенияУтвердить;
			Иначе
				Шапка1.Параметры.ШапкаРешениеЛьготаУтвердить =   "о назначении мер социальной поддержки";
			КонецЕсли;	
			ТабличныйДокумент.Вывести(Шапка1);
		Иначе
		    Шапка3 = Макет.ПолучитьОбласть("Шапка3");
			Шапка3.Параметры.ДатаРешение = Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
			Если ЗначениеЗаполнено(Выборка.Ссылка.ВидЛьготы.ТекстДляШапкиРешенияОтказать) Тогда
				Шапка3.Параметры.ШапкаРешениеЛьготаОтказ =  Выборка.Ссылка.ВидЛьготы.ТекстДляШапкиРешенияОтказать;
			Иначе
				Шапка3.Параметры.ШапкаРешениеЛьготаОтказ = "Об отказе в мерах социальной поддержке";
			КонецЕсли;	
			ТабличныйДокумент.Вывести(Шапка3);
		КонецЕсли;
		Для Каждого СтрокаНД Из  Выборка.Ссылка.НормативноПравовыеАкты  Цикл
			// описать норматив
			Если  СтрокаНД.НомерСтроки = 1 Тогда
				НормативОснование = "Согласно " + СтрокаНД.Наименование;
				
			Иначе
				НормативОснование = "; "+ НормативОснование + СтрокаНД.Наименование+";";
			КонецЕсли;
			
			Если  СтрокаНД.НомерСтроки = Выборка.Ссылка.НормативноПравовыеАкты.Количество() Тогда
				 НормативОснование =  НормативОснование + СтрокаНД.Наименование;
			КонецЕсли	
		КонецЦикла;
		
		Шапка2 = Макет.ПолучитьОбласть("Шапка2");
		Шапка2.Параметры.ЛьготнаяКатегория = Выборка.Ссылка.ЛьготнаяКатегория;
		Шапка2.Параметры.Заявитель = Выборка.Ссылка.Заявитель;
		Шапка2.Параметры.НомерЗаявленияДата  = Выборка.Ссылка.НомерЗаявленияДата;
		Шапка2.Параметры.Адрес = Выборка.Ссылка.Заявитель.АдресФактическогоПроживания;
		ТабличныйДокумент.Вывести(Шапка2);
		Если МассивОбъектов[Индекс].Решение = Перечисления.Решение.Отказ Тогда
			Отказано =  Макет.ПолучитьОбласть("Отказано");
			Отказано.Параметры.ОписаниеРешения = Выборка.Ссылка.ОписаниеРешения;
			ТабличныйДокумент.Вывести(Отказано);

		Иначе
			Назначено = Макет.ПолучитьОбласть("Назначено");
			Назначено.Параметры.ДатаНачало =  Формат(Выборка.Ссылка.ДатаНачало,"ДФ=dd.MM.yyyy");
			Назначено.Параметры.ДатаОкончания =  Формат(Выборка.Ссылка.ДатаОкончания,"ДФ=dd.MM.yyyy");
			Назначено.Параметры.ОписаниеРешения = Выборка.Ссылка.ОписаниеРешения;
			ТабличныйДокумент.Вывести(Назначено);
		КонецЕсли;
				
		Для Каждого СтрокаК Из  Выборка.Ссылка.Комиссия  Цикл
			Область = Макет.ПолучитьОбласть("Должности");
			Область.Параметры.Должность = СтрокаК.Должность;             
			Область.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаК.Сотрудник);
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
		Индекс = Индекс + 1;
	КонецЦикла;	
	Возврат ТабличныйДокумент;
КонецФункции	

Функция ПечатьУведомление(МассивОбъектов,ОбъектыПечати) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Уведомление";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Решение.ПФ_MXL_Уведомление");
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Решение КАК ТаблицаДокумента
	               |ГДЕ
	               |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ПервыйДокумент = Истина;
	Индекс = 0; 	
	Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы+1;
		Шапка = Макет.ПолучитьОбласть("Шапка");
		МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Ссылка.НомерЗаявленияДата," ");
		Если МассивСтроки.Количество()>0 Тогда
			МассивДатыЗаявления  = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Лев(МассивСтроки[2],10),".");
			Шапка.Параметры.ДатаЗаявления = Формат(Дата(МассивДатыЗаявления[2],МассивДатыЗаявления[1],МассивДатыЗаявления[0]),"ДФ=dd.ММ.yyyy");
			Шапка.Параметры.НомерЗаявления =  МассивСтроки[0];
		КонецЕсли;
		Шапка.Параметры.Адрес = Выборка.Ссылка.Заявитель.АдресФактическогоПроживания;
		Шапка.Параметры.Заявитель = Выборка.Ссылка.Заявитель;
		ТабличныйДокумент.Вывести(Шапка);
		Если МассивОбъектов[Индекс].Решение = Перечисления.Решение.Отказ Тогда
			Отказано =  Макет.ПолучитьОбласть("Отказано");
			Отказано.Параметры.ОписаниеРешения = Выборка.Ссылка.ОписаниеРешения;
			ТабличныйДокумент.Вывести(Отказано);
		Иначе
			Назначено = Макет.ПолучитьОбласть("Назначено");
			Назначено.Параметры.ДатаНачало =  Формат(Выборка.Ссылка.ДатаНачало,"ДФ=dd.ММ.yyyy");
			Назначено.Параметры.ДатаОкончания =  Формат(Выборка.Ссылка.ДатаОкончания,"ДФ=dd.ММ.yyyy");
			Назначено.Параметры.ОписаниеРешения = Выборка.Ссылка.ОписаниеРешения;
			ТабличныйДокумент.Вывести(Назначено);
		КонецЕсли;		
		Для Каждого СтрокаК Из  Выборка.Ссылка.Комиссия  Цикл
			Область = Макет.ПолучитьОбласть("Должности");
			Область.Параметры.Должность = СтрокаК.Должность;             
			Область.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаК.Сотрудник);
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
	КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции
